class script(object):
    START_TXT = """<b>нєу {}, {}</b>

<b>🤖 ι αм  <a href=https://t.me/{}>{}</a>, тнє мσѕт ρσωєяfυℓℓ αυтσ fιℓтєя вσт ωιтн ρяємιυм fєαυтєяєѕ .</b>
"""


    GSTART_TXT = """<b>нєу {},</b>

<b>🤖 ι αм <a href=https://t.me/{}>{}</a>, тнє мσѕт ρσωєяfυℓℓ αυтσ fιℓтєя вσт ωιтн ρяємιυм fєαυтєяєѕ.</b>"""

    
    HELP_TXT = """<b>
    
✨ нσω.тσ яєqυєѕт мσνιєѕ αи∂ ѕєяιєѕ✨  

1️⃣ ѕєαя¢н тнє ¢σяяє¢т иαмє σи gσσgℓє.  
2️⃣ ѕєи∂ тнє иαмє ιи тнє gяσυρ.  
3️⃣ υѕє тнιѕ fσямαт:  

🤩 fσя ѕєяιєѕ:  
✦ ѕєяιєѕ иαмє +ѕєαѕσи +єριѕσ∂є 

🤩 fσя мσνιєѕ  
✦ мσνιє иαмє +мσνιє уєαя

🚀 fσℓℓσω тнєѕє ѕтєρѕ
</b>"""

    ABOUT_TXT = """<b>╭────[ му ∂єтαιℓѕ ]────⍟
♥︎ ɱყ ɳαɱҽ : <a href=https://t.me/{}>{}</a>
♥︎ ԃҽʋҽʅσρҽɾ : <a href='https://t.me/Rider_Epic'>σωиєя</a> 
♥︎ ʅιႦɾαɾყ : <a href='https://docs.pyrogram.org/'>ρуяσgяαм</a>
♥︎ ʅαυɳɠυαɠҽ : <a href='https://www.python.org/download/releases/3.0/'>ρутнσи 3</a> 
♥︎ ԃαƚαႦαʂҽ : <a href='https://t.me/iqbaleditzzz/347'>мσиgσ ∂в</a>  
♥︎ Ⴆυιʅԃ ʂƚαƚυʂ : ν1.4 [ ѕтαвℓє ]
╰───────────────⍟</b>"""
    RESTART_TXT = """
<b>{} вσт яєѕтαятє∂ !

📅 ∂αтє : <code>{}</code>
⏰ тιмє : <code>{}</code>
🌐 тιмєzσиє : <code>Asia/Kolkata</code>
🛠️ вυιℓ∂ ѕтαтυѕ: <code> v1.4 [ Sᴛᴀʙʟᴇ ]</code>
</b>"""

    CHANNELS = """
<b>⚡ gяσυρѕ αи∂ ¢нαиєℓℓ ιиfσ ♥︎

☆ αℓℓ иєω мσνιєѕ αи∂ ѕєяιєѕ
☆ fαѕтєѕт вσтѕ αяє α∂∂є∂
☆ fяєє αи∂ єαѕу тσ.υѕє
☆ 24/7 ѕєяνι¢є αναιℓαвℓє (мαу вє ѕσмє ѕтσρѕ тσ єяяσяѕ).</b>"""

    MULTI_STATUS_TXT = """<b>🗃υѕєяѕ ∂αтαвαѕє 🗃

» тσтαℓ υѕєяѕ - {0}
» тσтαℓ gяσυρѕ - {1}
» ρяємιυм υѕєяѕ - {2}

📤 ∂αтαвαѕє 1 📤

» тσтqℓ fιℓєѕ - {3}
» ∂в ѕтσяαgє - {4}
» ¢ℓυѕтєя ѕтσяαgє - {5} / 512.00 MB
» fяєє ѕтσяαgє - {6}

📥 ∂αтαвαѕє 2 📥

» тσтαℓ fιℓєѕ - {7}
» ∂в ѕтσяαgє - {8}
» ¢ℓυѕтєя ѕтσяαgє - {9} / 512.00 MB
» fяєє ѕтσяαgє - {10}

🤖 вσт ∂єтαιℓѕ 🤖

» υρтιмє - {11}
» яαм - {12}%
» ¢ρυ - {13}%

» тσтqℓ fιℓєѕ - {14}</b>"""

    STATUS_TXT = """<b>🗃υѕєяѕ ∂αтαвαѕє 🗃

» тσтαℓ υѕєяѕ - {0}
» тσтαℓ gяσυρѕ - {1}
» ρяємιυм υѕєяѕ - {2}

📤 fιℓєѕ ∂αтαвαѕє 📤

» тσтαℓ fιℓєѕ - {3}
» ∂в ѕтσяαgє - {4}
» ¢ℓυѕтєя ѕтσяαgє.- {5} / 512.00 MB
» fяєє ѕтσяαgє  - {6}

🤖 вσт ∂єтαιℓѕ 🤖

» υρтιмє - {7}
» яαм - {8}%
» ¢ρυ - {9}%</b>"""

    LOG_TEXT_G = """#NewGroup
    
gяσυρ = {}
ι∂ = <code>{}</code>
тσтαℓ мємвєяѕ = <code>{}</code>
α∂∂є∂ ву - {}
"""

    LOG_TEXT_P = """#NewUser
    
ι∂ - <code>{}</code>
иαмє - {}
"""
    NT_ADMIN_ALRT_TXT = ""‼️уσυ αяє иσт α∂мιи ιи тнιѕ gяσυρ ‼️"""

    NT_ALRT_TXT = """иσт уσυяѕ"""
    
    ALRT_TXT = """нєℓℓσ {},
тнιѕ ιѕ иσт уσυя мσνιє яєqυєѕт,
яєqυєѕт уσυяѕ..."""

    OLD_ALRT_TXT = """нєу {},
уσυ αяє υѕιиg σиє σf σℓ∂ мαѕѕєgєѕ, 
ρℓєαѕє ѕєи∂ тнє яєqυєѕт αgαιи."""

    PRE_STREAM = """🤠 тнιѕ fєαυтєя σиℓу fσя ρяємιυм υѕєяѕ 😡

✨ υиℓσνк тнє єχ¢ℓυѕινє ρяємιυм ¢σитєит  
💳 вυу ρяємιυм αи∂ gєт мαиу fєαυтєѕ αяє υиℓσ¢к"""

    PRE_STREAM_ALERT = """🙃 ρяємιυм ¢σитєит 😇 ❗  
🔓 υиℓσ¢к тσ υρgα∂є тнє ρяємιυм"""

    CUDNT_FND = SPELLING_ERROR_TXT = """<b>‼️ ѕρєℓℓιиg мιѕтαкє вяσσι !</b>  
<b>😊 иσ ωσяяιєѕ - ¢нσσѕє тнє ¢σяяє¢т σρтισи вєℓσω 👇</b>

<blockquote>👇вєℓσω тнє ѕρєℓℓιиg ιѕ мιѕтαкє ρℓєαѕє ¢нє¢к αgαιи</blockquote>"""


    DEL_MSG = """⚠️ тнιѕ мσνιє fιℓє ωιℓℓ вє ∂єℓєтє∂ αfєя α тιмє <b><u><code>{}</code></u></b>

<blockquote expandable><b><i>ρℓєαѕє fσяωαя∂ тнιѕ fιℓє αи∂ уσυя ѕανє∂ мαѕѕєgєѕ αи∂ ѕтαят ∂σωиℓσα∂</i></b></blockquote>"""





    I_CUDNT = """<b>ѕσяяу тнєяє αяє иσ fιℓєѕ ιи уσυя яєqυєѕт {} 😕

¢нє¢к уσυ ѕρєℓℓιиg мιѕтαкя ιи gσσgℓє 😃

📝 мσνιє яєqυєѕт fσямαт 👇

⚜️ єχαмρℓє : ∂α¢σιт 2026

📝 ѕєяιєѕ яєqυєѕт fσямαт 👇

⚜️ єχαмρℓє : ѕρι∂єямαи ѕ01 єρ01

🚯 ∂σи`т υѕє ➠ ':(!,./)</b>"""
    
    I_CUD_NT = """<b>ι ¢συℓ∂и`т fιи∂ мσνιє тнιѕ яєℓαтє∂ {}.

мσνιє ιѕ иσт αναιℓαвℓє вєα¢αυѕє:

1) σтт σя ∂ν∂ ι∂ иσт яєℓєαѕє∂

2) туρє иαмє ωιтн уєαя

3) мσνιє ιѕ иσт αναιℓαвℓє ιи συя ∂αтαвαѕє</b>"""

    MVE_NT_FND = NOT_FOUND_TXT = """<b>😌 тнιѕ мσνιє ιѕ иσт αναιℓαвℓє ιи му ∂αтαвαѕє.</b>

<blockquote>😌 тнιѕ мσνιє ιѕ иσт ιи му ∂αтαвαѕє</blockquote>"""

    
    TOP_ALRT_MSG = """ѕєαя¢нιиg qυєяу ιи му ∂αтαвαѕє..."""

    MELCOW_ENG = """<b>👋 нєу {},\n\n🍁 ωєℓ¢σмє тσ\n🌟 {} \n\n нєяє уσυ ¢αи ѕєαя¢н уσυя fανяαтє мσνιє/ѕєяιєѕ ιи тнιѕ αяєα 🔎\n\n⚠️ ɪꜰ ʏᴏᴜ'ʀᴇ ʜᴀᴠɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʀᴇɢᴀʀᴅɪɴɢ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ᴏʀ ꜱᴏᴍᴇᴛʜɪɴɢ ᴇʟꜱᴇ ᴛʜᴇɴ ᴍᴇꜱꜱᴀɢᴇ ʜᴇʀᴇ 👇</b>"""
    
    DISCLAIMER_TXT = """
<b>тнιѕ ιѕ αи ѕσυя¢є ρяσᴊє¢т.

αℓℓ fιℓєѕ αяє ¢яєαтє∂ σωи fяσм ιитяєиєт. ᴊυѕт fσя ѕєαя¢н αи∂ gєт fιℓєѕ fяσм ιи∂єχє∂ вσт. ωє яєѕρє¢т уσυ тσ αℓℓ αи∂ gєт ιиѕтαитz σ¢¢υяαℓℓу. ιf ρℓαgαиg ρℓєαѕє ѕσ тнαт ιт ¢αи вє яємσνє∂ ρяσвαвℓу. ιт ιѕ fσяявιввєи , ѕтяєαм, яєρяσ∂υ¢є, ѕнαяє σя συя ѕανє∂ мαѕѕєgєѕ тнє ¢σитєит ¢яєαтσя нαѕ α ℓєgαℓ ¢σитєитѕ. ιf уσυ вєℓєινє тнιѕ вσт αи∂ gєт fιℓєѕ,¢σитα¢т тнє яєѕρє¢тινє ¢нαиєℓℓ αи∂ gяσυρ. тнιѕ вσт нανє α σωи ¢σитєит σf σωиєя, ιт σиℓу ιи∂єχ fяσм тєℓєgяαм. 
</b>"""

    DREAMXBOTZ_DONATION = DONATE_TXT = """<b>👋 нєу {},</b>

<blockquote>💖 <b>ℓℓєαѕє ∂σиαтє тσ ∂єνσℓσρєя</b></blockquote>

<b>🔧 тσ кєєρ ѕєяνι¢є αℓινє, α∂∂ иєω fєαυтєяѕ αи∂  & υℓℓσα∂ тнє вєѕт мσνιєѕ/ωєвѕєяιєѕ иσи ѕтσρ ιи нιgн qυαℓιту, ωє иєє∂ уσυя ѕυρρσятѕ.
ιт нєℓρѕ тσ ѕєяνєя σf яєи∂єя.</b>

<b>😄уσυ ¢αи ∂σиαтє αиу αмσυит σf уσυ.</b>

<blockquote>🎉 <b>ѕєℓє¢т тнє ∂σиαтє мєтнσ∂ 👇</b></blockquote>

➤ 📷 Qʀ ᴄᴏᴅᴇ → <a href='https://graph.org/file/7f253ec794c27901c9536-0c7a53cee7047dd6d0.jpg'>¢ℓι¢к нєяє тσ ѕ¢αи</a>  
➤ 💸 ᴜᴘɪ ɪᴅ → <code>{}</code>

‼️ <b>мυѕт ѕєи∂ ѕ¢яєєиѕнσт αfтєя ραумєит.</b>"""


    SINFO = """
⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯
ѕєяιєѕ яєqυєѕт fσямαт
⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯

gσ тσ gσσgℓє ➠ туρє тнє ѕєяιєѕ иαмє ➠ ¢σяяє¢т ¢σρу тнє иαмє ➠ ραѕтє ιи тнιѕ gяσυρ

єχαмρℓє : ѕρι∂єямαи ѕ01єρ02

🚯 ∂σи`т υѕє ➠ ':(!,./)"""

    NORSLTS = """ 
#NoResults

ι∂ : <code>{}</code>
иαмє : {}

мєѕѕαgє : <b>{}</b>"""
    
    CAPTION = """<b><a href="https://t.me/EpicCastle">{file_name}</a></b>\n\n<b>⚜️ Powered By : <a href="https://t.me/EpicCastle">[ єρι¢¢αѕтℓє ]</a></b>"""

    
    MOVIE_UPDATE_NOTIFY_TXT = """
</b><a href={poster_url}>📥</a><a href={imdb_url}>New {tag} Added</a></b>

<blockquote>✨ тιтℓє : <code>{filename}</code>

🎭 gєияєѕ : <b>{genres}</b>
📺 σтт        : <b>{ott}</b>
🎞️ qυαℓιту : <b>{quality}</b>
🎧 αυ∂ισ    : <b>{language}</b>
🔥 яαтιиg   : <b>{rating}</b>
{episodes}
</blockquote>

🔍 <b>ѕєαя¢н →</b> {search_link}
"""


    IMDB_TEMPLATE_TXT = """<b><a href={url}>{title} (<a href={url}/releaseinfo>{year}</a>)

яαтιиg : <a href={url}/ratings>{rating}</a>
gєияє : {genres}
αυ∂ισ : {languages}

ѕнσωи ιи : {remaining_seconds} <i>ѕє¢</i>⚡️
<b>яєq ву : {message.from_user.mention}</b>"""

    LOGO = r"""
    𝙱𝙾𝚃 𝚆𝙾𝚁𝙺𝙸𝙽𝙶 𝙿𝚁𝙾𝙿𝙴𝚁𝙻𝚈....
    """


    #PLANS

    PAGE_TXT = """ωну αяє уσυ ѕσ ¢υяισυѕ ⁉️"""

    PURCHASE_TXT = """ѕєℓє¢т уσυ ραумєит мєтσ∂."""

    

    PREMIUM_TEXT = """<blockquote>🎖️ <b>αναιℓαвℓє ρℓαиѕ</b></blockquote>


◉ 07 ∂αуѕ - 10 ₹  / 10 ѕтαя
◉ 15 ∂αуѕ - 20 ₹  / 20 ѕтαя
◉ 30 ∂αуѕ - 40 ₹  / 40 ѕтαя
◉ 45 ∂αуѕ - 55 ₹  / 55 ѕтαя
◉ 60 ∂αуѕ - 75 ₹  / 75 ѕтαя

•─────•─────────•─────•
🏷️ <a href='https://t.me/Rider_Epic'>ѕυвѕ¢яιρтισи ρяσσf</a>

‼️ мυѕт ѕєи∂ ѕ¢яєєиѕнσт αfтєя.ραумєит.
‼️ αfтєя ραумєит уσυ gινє ѕσмє тιмє αи∂ ι αρρσνє уσυ нανє α ρяємιυм ¢σитєит."""

    PREMIUM_STAR_TEXT = """<b><blockquote>ραумєит мєтнσ∂: тєℓєgяαм ѕтαяѕ⭐</blockquote>

иσω уσυ ¢αи вυу ρяємιυм fяσм тєℓєgяαм ѕтαяѕ⭐.
ιf уσυ fα¢є αиу ρяσвℓєм, тαкє.α ѕ¢яєєиѕнσт αи∂ ѕєи∂ тσ - @Rider_Epic

ѕєℓє¢т уσυя ραумєит мєтнσ∂ 👇.</b>
"""

    PREMIUM_UPI_TEXT = """<b><blockquote>ραумєит мєтнσ∂: ᴜᴘɪ</blockquote>

уσυ ρυя¢нαѕє ρяємιυм fяσм му υρι,иєт вαикιиg.

💳 υρι ι∂ - <code>manjappashirattti84-1@okicici</code>

💢 мυѕт ѕєи∂ ѕ¢яєєиѕнσт αfтєя ραумєит.

‼️ αfтєя ραумєит тσ gινє ѕσмє тιмє тσ α∂∂ ιи ρяємєιυм ℓιѕт.</b>"""


    PREMIUM_END_TEXT = """<b>нєу {},</b>

<b>уσυя ρяємιυм α¢¢єѕѕ ᴊαѕ вєєи яємσνє∂.</b>  
<b>тнαик fσя υѕιиg συя ѕєяνι¢є 😊</b>  
<b>¢ℓι¢к σи /plan тσ gєт ρℓαи ∂єтαιℓѕ.</b>

<blockquote>уσυяѕ<b>ρяємιυм α¢¢єѕѕ</b> ѕυ¢¢єѕfυℓℓу।  
тнαикѕ fσя υѕιиg му fєαυтєяѕ 🥳  
му ѕєяνι¢є тσ ѕєє <b>/plan</b>¢ℓι¢к мє</blockquote>
"""

    
    BPREMIUM_TXT = """<blockquote>🎁 <b>ρяємιυм fєαυтєяєѕ</b> :</blockquote>

✦ иσ иєє∂ тσ νєяιfу
✦ иσ иєє∂ тσ σρєи ℓιикѕ
✦ ∂ιяє¢т fιℓєѕ  
✦ α∂-fяєє єχρєяιєи¢є 
✦ нιgн ѕρєє∂ ∂σωиℓσα∂ ℓιикѕ                        
✦ мυℓтι ρℓαуєя ѕтяєαм/∂σωиℓσα∂ ℓιикѕ                           
✦ υиℓιмιтє∂ мσνιє/ѕєяιєѕ                                                                       
✦ fυℓℓ α∂мιи ѕυρρσятѕ                              
✦ яєqυєѕт ωιℓℓ вє ¢σмσℓєтє ιи 1н [ ιf αναιℓαвℓє ]

• уσυ ¢αи gєт ρяємιυм ωιтн уσυ fяєιи∂ яєffєяαℓ ¢σ∂є 

•─────•─────────•─────•
◉ ¢нє¢к тσ gєт уσυя ρℓαи ∂єтαιℓѕ : /myplan

‼️ αfтєя ѕєи∂ιиg α ѕ¢яєєиѕнσт тσ gινє ѕσмє тιмє тσ α∂∂ ρяємιυм ℓιѕт."""  


    PREPLANS_TXT = PREMIUM_TXT = """<b>👋 нєу {},

<blockquote>🎖️ <b>αναιℓαвℓє ρℓαиѕ</b></blockquote>

◉ 07 ∂αуѕ - 10 ₹  
◉ 15 ∂αуѕ - 20 ₹  
◉ 30 ∂αуѕ - 40 ₹  
◉ 45 ∂αуѕ - 55 ₹  
◉ 60 ∂αуѕ - 75 ₹  

•─────•─────────•─────•

🏷️ <b>ᴘᴀʏᴍᴇɴᴛ ᴍᴇᴛʜᴏᴅꜱ</b>

💸 ᴜᴘɪ ɪᴅ → <code>{}</code>  
📷 ǫʀ ᴄᴏᴅᴇ → <a href='{}'>ᴄʟɪᴄᴋ ʜᴇʀᴇ ᴛᴏ ꜱᴄᴀɴ</a>  

🧾 ᴘᴀʏ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ!

‼️ ᴍᴜꜱᴛ ꜱᴇɴᴅ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.  
‼️ ᴀꜰᴛᴇʀ ꜱᴇɴᴅɪɴɢ ᴀ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ, ɢɪᴠᴇ ᴜꜱ ꜱᴏᴍᴇ ᴛɪᴍᴇ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴛʜᴇ ᴘʀᴇᴍɪᴜᴍ ʟɪꜱᴛ.

💎 ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ → /myplan</b>"""


    FREE_TXT = """<b>👋 ʜᴇʏ {},
    
🎉 <u>ꜰʀᴇᴇ ᴛʀɪᴀʟ</u> 🎉
❗ ᴏɴʟʏ ꜰᴏʀ 5 ᴍɪɴᴜᴛᴇꜱ
 
○ ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴏᴘᴇɴ ʟɪɴᴋꜱ
○ ᴍᴜʟᴛɪ-ᴘʟᴀʏᴇʀ sᴛʀᴇᴀᴍɪɴɢ ʟɪɴᴋs
○ ᴀᴅ-ғʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ

👨‍💻 ᴄᴏɴᴛᴀᴄᴛ ᴛʜᴇ <a href='https://t.me/Rider_Epix'>Owner</a> ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴛʀɪᴀʟ.

➛ ᴜꜱᴇ /plan ᴛᴏ ꜱᴇᴇ ᴀʟʟ ᴏᴜʀ ᴘʟᴀɴꜱ ᴀᴛ ᴏɴᴄᴇ.
➛ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴀᴄᴛɪᴠᴇ ᴘʟᴀɴ ʙʏ ᴜꜱɪɴɢ : /myplan</b>"""

    
    UPI_TXT = """<b>👋 ʜᴇʏ {},
    
 ᴘᴀʏ ᴀᴍᴍᴏᴜɴᴛ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ ᴍᴇᴍʙᴇʀꜱʜɪᴘ !

💵 ᴜᴘɪ ɪᴅ - <code>{}</code>

‼️ ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.</b>"""

    QR_TXT = """<b>👋 ʜᴇʏ {},
    
 ᴘᴀʏ ᴀᴍᴍᴏᴜɴᴛ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ ᴍᴇᴍʙᴇʀꜱʜɪᴘ !

📸 ǫʀ ᴄᴏᴅᴇ - <a href='{}'>ᴄʟɪᴄᴋ ʜᴇʀᴇ ᴛᴏ ꜱᴄᴀɴ</a>

‼️ ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.</b>"""

    SOURCE_TXT ="""<b>ՏOᑌᖇᑕᗴ ᑕOᗪᗴ : 👇 </b>

This Is An Open-Source Project. You Can Use It Freely, But Selling The Source Code Is Strictly Prohibited.\n
ꜱᴏᴜʀᴄᴇ ᴄᴏᴅᴇ ʜᴇʀᴇ ◉› :<a href='https://t.me/Rider_Epic'>Contact Owner</a>\n """

    SETTING_TXT = """    
<u>ꜱᴇᴛᴛɪɴɢꜱ</u> :
- ꜱᴇᴛᴛɪɴɢꜱ ɪꜱ ᴛʜᴇ ᴍᴏꜱᴛ ɪᴍᴘᴏʀᴛᴀɴᴛ ꜰᴇᴀᴛᴜʀᴇ ᴏꜰ ᴛʜɪꜱ ʙᴏᴛ.
- ʏᴏᴜ ᴄᴀɴ ᴇᴀꜱɪʟʏ ᴄᴜꜱᴛᴏᴍɪᴢᴇ ᴛʜɪꜱ ʙᴏᴛ ꜰᴏʀ ʏᴏᴜʀ ɢʀᴏᴜᴘ.

<u>ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</u> :
• /settings - ᴄʜᴀɴɢᴇ ᴛʜᴇ ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ ᴀꜱ ʏᴏᴜʀ ᴡɪꜱʜ.
• /set_shortner - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_tutorial - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_time - ꜱᴇᴛ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_time_2 - ꜱᴇᴛ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_log_channel - ꜱᴇᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ʟᴏɢ ᴄʜᴀɴɴᴇʟ.
• /set_fsub - ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /remove_fsub - ʀᴇᴍᴏᴠᴇ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /reset_group - ʀᴇꜱᴇᴛ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ.
• /details - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ."""
    
    VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},

📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ ᴛᴏᴅᴀʏ, ᴘʟᴇᴀꜱᴇ ᴄʟɪᴄᴋ ᴏɴ ᴠᴇʀɪꜰʏ & ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇꜱꜱ ꜰᴏʀ ᴛɪʟʟ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 1/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ).</i></b>"""
    

    VERIFY_COMPLETE_TEXT = """<b><i>👋 ʜᴇʏ {},

ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.</i></b>"""

    SECOND_VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},

📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ, ᴛᴀᴘ ᴏɴ ᴛʜᴇ ᴠᴇʀɪꜰʏ ʟɪɴᴋ ᴀɴᴅ ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ᴛɪʟʟ ɴᴇxᴛ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ.

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 2/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ).</i></b>"""

    SECOND_VERIFY_COMPLETE_TEXT = """<b><i>👋 ʜᴇʏ {},
    
ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.</i></b>"""

    THIRDT_VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},
    
📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ, ᴛᴀᴘ ᴏɴ ᴛʜᴇ ᴠᴇʀɪꜰʏ ʟɪɴᴋ & ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ꜰᴜʟʟ ᴅᴀʏ.</u>

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 3/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ)</i></b>"""

    THIRDT_VERIFY_COMPLETE_TEXT= """<b><i>👋 ʜᴇʏ {},
    
ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 3ʀᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ꜰᴜʟʟ ᴅᴀʏ.</i></b>"""

    VERIFIED_LOG_TEXT = """ᴜꜱᴇʀ ᴠᴇʀɪꜰɪᴇᴅ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ ✓

👤 ɴᴀᴍᴇ:- {} [ <code>{}</code> ]

📆 ᴅᴀᴛᴇ:- <code>{} </code>

#Verificaton_{}_Completed"""


    ADMIN_CMD = """ʜᴇʏ 👋,

📚 ʜᴇʀᴇ ᴀʀᴇ ᴍʏ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ ꜰᴏʀ ᴀʟʟ ʙᴏᴛ ᴀᴅᴍɪɴꜱ ⇊

• /start - <code>ᴛᴏ ᴜꜱᴇ ᴍʏ ꜰᴇᴀᴛᴜʀᴇꜱ.</code>
• /stats - <code>ɢᴇᴛ ᴛʜᴇ ᴛᴏᴛᴀʟ ᴜꜱᴇʀꜱ ᴀɴᴅ ᴄʜᴀᴛꜱ.</code>
• /del_msg - <code>ʀᴇᴍᴏᴠᴇ ғɪʟᴇ ɴᴀᴍᴇ ᴄᴏʟʟᴇᴄᴛɪᴏɴ ɴᴏтɪғɪᴄᴀᴛɪᴏɴ...</code>
• /movie_update - <code>ᴏɴ / ᴏғғ ᴀᴄᴄᴏʀᴅɪɴɢ ʏᴏᴜʀ ɴᴇᴇᴅᴇᴅ...</code> 
• /pm_search - <code>ᴘᴍ sᴇᴀʀᴄʜ ᴏɴ / ᴏғғ ᴀᴄᴄᴏʀᴅɪɴɢ ʏᴏᴜʀ ɴᴇᴇᴅᴇᴅ...</code>
• /verify - <code>ᴛᴜʀɴ ᴏɴ / ᴏꜰꜰ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ (ᴏɴʟʏ ᴡᴏʀᴋ ɪɴ ɢʀᴏᴜᴘ)</code>
• /logs - <code>ɢᴇᴛ ᴛʜᴇ ʀᴇᴄᴇɴᴛ ᴇʀʀᴏʀꜱ.</code>
• /delete - <code>ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴇ ꜰʀᴏᴍ ᴅʙ.</code>
• /users - <code>ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴜꜱᴇʀꜱ ᴀɴᴅ ɪᴅꜱ.</code>
• /chats - <code>ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴄʜᴀᴛꜱ ᴀɴᴅ ɪᴅꜱ.</code>
• /leave  - <code>ʟᴇᴀᴠᴇ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ.</code>
• /disable  -  <code>ᴅɪꜱᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.</code>
• /ban  - <code>ʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /unban  - <code>ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /broadcast - <code>ʙʀᴏᴀᴅᴄᴀꜱᴛ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜꜱᴇʀꜱ.</code>
• /grp_broadcast - <code>ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘs.</code>
• /deletefiles - <code>ᴅᴇʟᴇᴛᴇ CᴀᴍRɪᴘ ᴀɴᴅ PʀᴇDVD ғɪʟᴇs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ's ᴅᴀᴛᴀʙᴀsᴇ.</code>
• /send - <code>ꜱᴇɴᴅ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴜꜱᴇʀ.</code>
• /add_premium - <code>ᴀᴅᴅ ᴀɴʏ ᴜꜱᴇʀ ᴛᴏ ᴘʀᴇᴍɪᴜᴍ.</code>
• /remove_premium - <code>ʀᴇᴍᴏᴠᴇ ᴀɴʏ ᴜꜱᴇʀ ꜰʀᴏᴍ ᴘʀᴇᴍɪᴜᴍ.</code>
• /premium_users - <code>ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴘʀᴇᴍɪᴜᴍ ᴜꜱᴇʀꜱ.</code>
• /get_premium - <code>ɢᴇᴛ ɪɴꜰᴏ ᴏꜰ ᴀɴʏ ᴘʀᴇᴍɪᴜᴍ ᴜꜱᴇʀ.</code>
• /restart - <code>ʀᴇꜱᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ.</code>"""

    GROUP_CMD = """ʜᴇʏ 👋,
📚 ʜᴇʀᴇ ᴀʀᴇ ᴍʏ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ ꜰᴏʀ ᴄᴜꜱᴛᴏᴍɪᴢᴇᴅ ɢʀᴏᴜᴘꜱ ⇊

• /settings - ᴄʜᴀɴɢᴇ ᴛʜᴇ ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ ᴀꜱ ʏᴏᴜʀ ᴡɪꜱʜ.
• /set_shortner - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_tutorial - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_time - ꜱᴇᴛ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_time_2 - ꜱᴇᴛ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_log_channel - ꜱᴇᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ʟᴏɢ ᴄʜᴀɴɴᴇʟ.
• /set_fsub - ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /remove_fsub - ʀᴇᴍᴏᴠᴇ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /reset_group - ʀᴇꜱᴇᴛ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ.
• /details - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ."""    



    
